#!/usr/bin/env bash

#          ╭──────────────────────────────────────────────────────────╮
#          │                        环境相关                          │
#          ╰──────────────────────────────────────────────────────────╯


# 当前项目根目录绝对路径
# declare -r BASE_PATH="$PWD"
# declare -r BASE_PATH=$(cd "$(dirname $0)";pwd)
# declare -r CUR_PATH=$( cd "$( dirname "${BASH_SOURCE[0]}" )" && pwd )
declare -r BASE_PATH=$( cd "$( dirname "${BASH_SOURCE[0]}" )" && pwd )

###########################################################################

#          ╭──────────────────────────────────────────────────────────╮
#          │                        测试	                          │
#          ╰──────────────────────────────────────────────────────────╯

echo $BASE_PATH
# echo $CUR_PATH
